#include <iostream>
#include <vector>
using namespace std;

// Є ряд чисел. Вивести елементи, які не повторюються жодного разу
int main()
{
    int n;
    bool flag = 0;

    //ввід
    cin >> n; //вказати кількість елементів в масиві
    vector <int> a(n);
    for (int i = 0; i < n; i++) //записуємо масив довжиною, яку вказали
    {
        cin >> a[i]; // вводимо елементи
    }

    //обробка і вивід
    for (int i = 0; i < n; i++) //каунтер для порівняння раз
    {
        for (int j = 0; j < n; j++) //каунтер для порівняння два
        {
            //умова порівняння
            if (a[i] == a[j] && i != j) //якщо хоч один елемент дорівнює іншому, окрім себе
            {
                flag = 1; //ставимо флажок, що щось співпало
            }
        }

        if (flag == 0)//якщо не співпало з жодним,
        {
            cout << a[i] << " ";//друкуємо
        }
        flag = 0;//обнуляємо флаг
    }
    return 0;
}
